In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("./resource/titanic.csv")
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
340,341,1,2,"Navratil, Master. Edmond Roger",male,2.0,1,1,230080,26.0000,F2,S
222,223,0,3,"Green, Mr. George Henry",male,51.0,0,0,21440,8.0500,NaN,S
118,119,0,1,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,PC 17558,247.5208,B58 B60,C
777,778,1,3,"Emanuel, Miss. Virginia Ethel",female,5.0,0,0,364516,12.4750,NaN,S
124,125,0,1,"White, Mr. Percival Wayland",male,54.0,0,1,35281,77.2875,D26,S

In [4]:
df.shape

(891, 12)

In [8]:
datasets = df[['Pclass', 'Sex', 'Age', 'Fare']]
datasets.sample(5)

     Pclass   Sex   Age     Fare
110       1  male  47.0  52.0000
825       3  male   NaN   6.9500
350       3  male  23.0   9.2250
135       2  male  23.0  15.0458
579       3  male  32.0   7.9250

In [7]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()
X['sex_n'] = le_sex.fit_transform(X.Sex)
X

/tmp/ipykernel_505712/58815428.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X['sex_n'] = le_sex.fit_transform(X.Sex)

     Pclass     Sex   Age     Fare  sex_n
0         3    male  22.0   7.2500      1
1         1  female  38.0  71.2833      0
2         3  female  26.0   7.9250      0
3         1  female  35.0  53.1000      0
4         3    male  35.0   8.0500      1
..      ...     ...   ...      ...    ...
886       2    male  27.0  13.0000      1
887       1  female  19.0  30.0000      0
888       3  female   NaN  23.4500      0
889       1    male  26.0  30.0000      1
890       3    male  32.0   7.7500      1

[891 rows x 5 columns]